Catalogs/ПрофилиНастроекЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПрофилиНастроекЭДО</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсВходящихДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлОферты</Name>
					<Comment>Двоичные данные подписанного файла оферты</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТекстаПриглашений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочтаДляУведомлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМестонахожденияОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СертификатыПодписейОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СертификатыЭЦП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКонтейнера</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>120</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьЭЦП</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийДокумент</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяИзвещениеОПолучении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОтветнаяПодпись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СостоянияОбменовЭДЧерезОператоровЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОбменовЭДЧерезОператоровЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПолученияЭД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПолученияПриглашений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>timestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрофильНастроекЭДО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиНастроекЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ПрофилиНастроекЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СоздатьНовыйПрофильНастроекЭДО(СтруктураПараметров, АдресВременногоХранилища = "", УникальныйИдентификатор = Неопределено) Экспорт
			
	Если УникальныйИдентификатор = Неопределено Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	СтруктураОтветаСервера 	= Неопределено;
	Организация 			= СтруктураПараметров.Организация;
	Пароль 					= СтруктураПараметров.Пароль;
	СертификатКриптографии 	= СтруктураПараметров.СертификатКриптографии;
	ФайлОферты 				= Новый ХранилищеЗначения(СтруктураПараметров.ФайлОферты, Новый СжатиеДанных(9));

	ИспользоватьЭП = ЗначениеЗаполнено(СертификатКриптографии);
	СсылкаНаПрофильНастроек = Справочники.ПрофилиНастроекЭДО.ПустаяСсылка();
	
	Попытка
		
		НачатьТранзакцию();
		НовыйПрофильНастроек = Справочники.ПрофилиНастроекЭДО.СоздатьЭлемент();
		
		ШаблонНаименование = НСтр("ru = '%1 - %2'");
		НовыйПрофильНастроек.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименование,
			"Didox", Организация);
			
		НовыйПрофильНастроек.Организация = Организация;
		НовыйПрофильНастроек.Пароль = Пароль;
		НовыйПрофильНастроек.ИдентификаторОрганизации = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН"));
		НовыйПрофильНастроек.ФайлОферты = ФайлОферты;
		
		// Настройки сертификатов
		Если ЭлектронныеДокументыСлужебныйВызовСервера.ПолучитьЗначениеФункциональнойОпции("ИспользоватьЭлектронныеЦифровыеПодписи") Тогда
			Если ИспользоватьЭП Тогда
				
				НоваяСтрока = НовыйПрофильНастроек.СертификатыПодписейОрганизации.Добавить();
				НоваяСтрока.Сертификат = СертификатКриптографии;
				
			КонецЕсли;
		КонецЕсли;
		
		
		Если НовыйПрофильНастроек.ПрофильНастроекЭДОУникален() Тогда
			
			НовыйПрофильНастроек.Записать();
			
		Иначе
			
			АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураОтветаСервера, УникальныйИдентификатор);
			ОтменитьТранзакцию();
			Возврат СсылкаНаПрофильНастроек;
			
		КонецЕсли;
		
		СсылкаНаПрофильНастроек = НовыйПрофильНастроек.Ссылка;
		
		СтруктураОтветаСервера = ЭлектронноеВзаимодействиеССерверомDidox.ПодключитьсяКЭДО(СсылкаНаПрофильНастроек, СертификатКриптографии);
		
		СтруктураОтветаСервера.Вставить("ПрофильНастроекЭДО");
		ОтветСервера = "";
		Если СтруктураОтветаСервера.Подключено Тогда
			
			СтруктураОтветаСервера.Вставить("ПрофильНастроекЭДО", СсылкаНаПрофильНастроек);
			
			ЗафиксироватьТранзакцию();
			
			УстановитьДатуСостоянияОбмена(СсылкаНаПрофильНастроек);
			
		Иначе
			
			АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураОтветаСервера, УникальныйИдентификатор);
			ОтменитьТранзакцию();
			Возврат Справочники.ПрофилиНастроекЭДО.ПустаяСсылка();
			
		КонецЕсли;
		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураОтветаСервера, УникальныйИдентификатор);
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Регистрация профиля настроек ЭДО", УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ПрофилиНастроекЭДО, , ОписаниеОшибки());
			
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(СтруктураОтветаСервера, УникальныйИдентификатор);
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
	Возврат СсылкаНаПрофильНастроек;	
	
КонецФункции

Процедура УстановитьДатуСостоянияОбмена(СсылкаНаПрофильНастроек)
	
	НаборЗаписей = РегистрыСведений.СостоянияОбменовЭДЧерезОператоровЭДО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрофильНастроекЭДО.Установить(СсылкаНаПрофильНастроек);
	НаборЗаписей.Прочитать();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ДатаПолученияЭД = НачалоДня(ТекущаяДатаСеанса());
	НоваяЗапись.ПрофильНастроекЭДО = СсылкаНаПрофильНастроек;
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ПолучитьДвоичныеДанныеОферты() Экспорт
	
	ДвоичныеДанныеОферты = Справочники.ПрофилиНастроекЭДО.ПолучитьМакет("ФайлОферты");
	
	Возврат ДвоичныеДанныеОферты;
	
КонецФункции

#КонецЕсли

Функция СгенерироватьНовыйПароль(МаксимальнаяДлинаПароля = 20) Экспорт
	СтрокаПароля = "";
	Регистр = Строка(новый УникальныйИдентификатор) + Строка(новый УникальныйИдентификатор) + Строка(новый УникальныйИдентификатор);
	СимволыРегистра = "0,1,2,3,4,5,6,7,8,9";
	ИзменениеРегистра = "";
	МассивРегистра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрокЭД(СимволыРегистра);
	Для А = 1 По СтрДлина(Регистр) Цикл
		Если Не МассивРегистра.Найти(Сред(Регистр, А, 1)) = Неопределено Тогда
			ИзменениеРегистра = ИзменениеРегистра + Сред(Регистр, А, 1);
		КонецЕсли;
	КонецЦикла;
	
	Основа = Строка(новый УникальныйИдентификатор);
	ЗапрещенныеСимволы = "-,l,I,О,0";
	МассивЗапрещенныхСимволов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрокЭД(ЗапрещенныеСимволы, ",", Истина);
	
	Для А = 1 По СтрДлина(Основа) Цикл
		Если МассивЗапрещенныхСимволов.Найти(Сред(Основа, А, 1)) = Неопределено Тогда
			Попытка
				РегистрСимвола = Число(Сред(ИзменениеРегистра, А, 1)) % 2;
			Исключение
				РегистрСимвола = 0;
			КонецПопытки;
			СтрокаПароля = СтрокаПароля + ?(РегистрСимвола = 0, НРег(Сред(Регистр, А, 1)), ВРЕГ(Сред(Регистр, А, 1)));
			Если СтрДлина(СтрокаПароля) >= МаксимальнаяДлинаПароля Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Лев(СтрокаПароля, МаксимальнаяДлинаПароля);
КонецФункции
